Tutoriels/interFoam/obstaclePoreux/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    RIGHT
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    obstacle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }



    TOP
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    frontPlane
    {
        type            empty;
    }

    backPlane
    {
        type            empty;
    }

    actuel2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}

// ************************************************************************* //
