Tutoriels/interFoam/obstaclePoreux/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    "(obstacle|BOTTOM|RIGHT)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    INLET
    {
        type            inletOutlet;
        inletValue      $internalField;
	value		$internalField;
    }

    TOP
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    frontPlane
    {
	type 		empty;
    }

    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
