Tutoriels/interFoam/obstaclePoreux/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

INLET
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          1;

    rampTime         2.0;

    activeAbsorption no;

    wavePeriods
    500
    (
(2.468260053622327)
(2.4609090567047303)
(2.4536017153974696)
(2.446337641963337)
(2.4391164532432716)
(2.4319377705889904)
(2.424801219796801)
(2.4177064310425807)
(2.4106530388178915)
(2.4036406818672096)
(2.39666900312625)
(2.389737649661359)
(2.3828462726099535)
(2.3759945271219944)
(2.36918207230246)
(2.362408571154809)
(2.3556736905254114)
(2.348977101048927)
(2.3423184770946097)
(2.3356974967135278)
(2.329113841586673)
(2.322567196973944)
(2.3160572516639943)
(2.3095836979249107)
(2.3031462314557274)
(2.2967445513387403)
(2.2903783599926206)
(2.2840473631263007)
(2.277751269693628)
(2.2714897918487607)
(2.2652626449023034)
(2.259069547278159)
(2.252910220471085)
(2.246784389004945)
(2.240691780391641)
(2.2346321250907053)
(2.228605156469553)
(2.2226106107643746)
(2.2166482270416545)
(2.2107177471603117)
(2.204818915734444)
(2.198951480096668)
(2.193115190262042)
(2.187309798892564)
(2.1815350612622293)
(2.175790735222641)
(2.170076581169166)
(2.1643923620076153)
(2.158737843121455)
(2.153112792339524)
(2.1475169799042564)
(2.1419501784404016)
(2.1364121629242248)
(2.1309027106531855)
(2.125421601216087)
(2.1199686164636815)
(2.114543540479728)
(2.1091461595524934)
(2.1037762621466913)
(2.0984336388758416)
(2.0931180824750593)
(2.0878293877742493)
(2.082567351671708)
(2.077331773108124)
(2.0721224530409703)
(2.0669391944192794)
(2.061781802158797)
(2.0566500831175074)
(2.0515438460715196)
(2.046462901691319)
(2.0414070625183625)
(2.036376142942029)
(2.0313699591769)
(2.0263883292403824)
(2.021431072930656)
(2.0164980118049454)
(2.0115889691581055)
(2.0067037700015273)
(2.00184224104234)
(1.9970042106629247)
(1.9921895089007136)
(1.9873979674282922)
(1.9826294195337792)
(1.977883700101493)
(1.973160645592893)
(1.9684600940277932)
(1.9637818849658457)
(1.9591258594882859)
(1.954491860179936)
(1.9498797311114666)
(1.9452893178219053)
(1.9407204673013938)
(1.936173027974186)
(1.9316468496818868)
(1.927141783666923)
(1.9226576825562465)
(1.9181944003452638)
(1.91375179238199)
...
    );

    waveHeights
    500
    (
(0.003396375978114038)
(0.003465582605517084)
(0.0035348340277564453)
(0.003604102681141913)
(0.0036733613825824588)
(0.003742583350202967)
(0.003811742222614056)
(0.0038808120768560753)
(0.0039497674450407584)
(0.00401858332971588)
(0.004087235217980238)
(0.004155699094378056)
(0.004223951452603125)
(0.004291969306044399)
(0.004359730197205976)
(0.004427212206035077)
(0.004494393957192506)
(0.004561254626300855)
(0.004627773945205883)
(0.004693932206287015)
(0.004759710265853199)
(0.004825089546660228)
(0.004890052039585765)
(0.004954580304498276)
(0.005018657470355605)
(0.005082267234568921)
(0.005145393861667251)
(0.005208022181297353)
(0.005270137585593207)
(0.0053317260259490035)
(0.005392774009228498)
(0.005453268593443401)
(0.005513197382932456)
(0.005572548523072161)
(0.0056313106945495425)
(0.005689473107226239)
(0.005747025493622623)
(0.005803958102049776)
(0.0058602616894161685)
(0.005915927513735166)
(0.005970947326358626)
(0.006025313363960844)
(0.006079018340296303)
(0.006132055437753933)
(0.006184418298729476)
(0.006236101016836831)
(0.006287098127978467)
(0.006337404601293945)
(0.0063870158300048845)
(0.006435927622173936)
(0.0064841361913943645)
(0.006531638147426086)
(0.006578430486793417)
(0.006624510583358699)
(0.006669876178885465)
(0.00671452537360408)
(0.006758456616791875)
(0.006801668697379345)
(0.006844160734593194)
(0.006885932168646325)
(0.006926982751484369)
(0.006967312537597604)
(0.007006921874906593)
(0.0070458113957293485)
(0.00708398200783715)
(0.00712143488560573)
(0.0071581714612680165)
(0.007194193416274056)
(0.007229502672763361)
(0.0072641013851544615)
(0.007297991931855923)
(0.007331176907102804)
(0.00736365911292206)
(0.007395441551230013)
(0.007426527416064694)
(0.0074569200859555046)
(0.0074866231164322965)
(0.007515640232675664)
(0.0075439753223100195)
(0.007571632428340605)
(0.007598615742235489)
(0.0076249295971531844)
(0.007650578461316479)
(0.007675566931532602)
(0.007699899726859943)
(0.007723581682421021)
(0.007746617743361498)
(0.007769012958954651)
(0.007790772476850691)
(0.007811901537470097)
(0.007832405468539996)
(0.007852289679772508)
(0.007871559657683892)
(0.00789022096055309)
(0.0079082792135183)
(0.007925740103810065)
(0.007942609376119245)
(0.007958892828098158)
...
    );

    wavePhases
    500
    (
(3.9403712137676257)
(1.3379148741293219)
(0.4373251693263442)
(3.757390144492135)
(2.6946365461728443)
(2.847471407320976)
(5.236124879227022)
(0.31935586517743947)
(5.500537405808065)
(0.2161793904814229)
(4.351873380480879)
(1.7480633191119748)
(5.0405743029810655)
(5.678920745086386)
(3.774038033987663)
(0.22576495337705288)
(5.74241390290153)
(4.442815769240813)
(5.915583773221718)
(2.272898274188814)
(4.50790646973132)
(6.198048935318311)
(1.566487733075253)
(2.9160185622781194)
(1.9930501734328046)
(3.2859186662168387)
(4.5596330141230155)
(2.8329413961354097)
(5.590651380854166)
(3.528155678892982)
(4.800637437878049)
(3.0254832583276423)
(4.836495286573035)
(2.331972658653093)
(2.9737523177664436)
(1.368956851766208)
(0.5163520943405127)
(3.218197392902381)
(4.605507700317755)
(2.4298168853456157)
(3.78261526296332)
(4.851724523947639)
(4.208132790285878)
(1.0696615485609062)
(3.4859949215117925)
(0.7079793229210983)
(5.604451858985839)
(5.66210630453873)
(5.909357794479012)
(4.988955215103309)
(6.187998040469611)
(2.7868791466730816)
(2.9145190466827327)
(2.875946556552399)
(2.8960293805866395)
(4.146701047604633)
(2.077184588336162)
(2.47866343985002)
(4.728403940975642)
(6.009679365585279)
(3.7006621364892682)
(2.545081042469698)
(3.1724042354610456)
(1.5194670523517824)
(0.13512003792552546)
(6.246386287971582)
(0.1666054646906022)
(1.0990977347183197)
(6.2440143959986)
(6.078828126072037)
(6.046111278939624)
(2.9340896746805725)
(4.84786664159036)
(0.8409562562007126)
(0.8748789258711581)
(5.948034603546749)
(0.22568913196077386)
(4.663916032956508)
(4.429956079130252)
(1.4685830442141927)
(0.9999832853214383)
(5.7175035934491225)
(2.7387589702536754)
(5.075605368462527)
(5.986317151865966)
(1.861449788793594)
(5.355255284834418)
(2.306587862053448)
(1.0308655067698929)
(5.685674795659116)
(5.715263767564443)
(1.3377555949737947)
(5.322692803375382)
(1.0330056794121112)
(5.121636665496333)
(3.1635612173048053)
(1.3983879325088462)
(4.556744568513736)
...
    );

    waveDirs
    500
    (
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
...
    );

}

RIGHT
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          1;
}
